Bookstore /app/controllers/main_controller.rb

  def welcome
    @message ="Welcome to our website"
    @entries = Entry.all
    @entries.each {|entry| entry.destroy}
---
SELECT "entries".* FROM "entries"
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]

  def goodbye
    @message ="Thanks for shopping by :)"
    @entries = Entry.all
---
SELECT "entries".* FROM "entries"