Bookstore /app/controllers/sign_up_controller.rb

  def name
    @fname = params[:fst_name]
    @lname = params[:lst_name]
    if @fname then @entry = Entry.create({:first_name => @fname, :last_name =>  @lname})
---
INSERT INTO "entries" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["created_at", 2016-12-01 20:52:05 UTC], ["updated_at", 2016-12-01 20:52:05 UTC]]

  def index
    @person = Entry.last
    @fname = @person.first_name
    @lname = @person.last_name
    @person.update_attributes({:book_name => params[:book],
                               :book_quantity => params[:quantity]})
---
SELECT  "entries".* FROM "entries" ORDER BY "entries"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "entries" SET "book_name" = ?, "book_quantity" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["book_name", "ruby"], ["book_quantity", 1], ["updated_at", 2016-12-01 21:59:31 UTC], ["id", 2]]

  def show
    stock = 1
    @person = Entry.last
---
SELECT  "entries".* FROM "entries" ORDER BY "entries"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def change
    @person = Entry.last
    @fname = @person.first_name
    @lname = @person.last_name
    @entry = Entry.create({:first_name => @fname, :last_name =>  @lname, :book_name => params[:book], :book_quantity => params[:quantity]})
---
SELECT  "entries".* FROM "entries" ORDER BY "entries"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "entries" ("first_name", "last_name", "book_name", "book_quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "m"], ["last_name", ""], ["book_name", "jkj"], ["book_quantity", 88], ["created_at", 2016-12-02 01:20:58 UTC], ["updated_at", 2016-12-02 01:20:58 UTC]]

  def order
    @person = Entry.find(:last)
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def deliver
    @person = Entry.last
---
SELECT  "entries".* FROM "entries" ORDER BY "entries"."id" DESC LIMIT ?  [["LIMIT", 1]]